// 7.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <clocale>

using namespace std;
double V(double C) {
    const size_t M = 2;//СТОЛБЦЫ
    int** a;
    a = new int* [C];
    for (size_t i = 0; i < C; i++) {
        a[i] = new int[M + 1];
    }

    for (int i = 0; i < C; ++i) {
        for (int j = 0; j < M; ++j)
            a[i][j] = rand() % 10;
    }
    for (int i = 0; i < C; ++i) {
        for (int j = 0; j < M; ++j) {
            cout << a[i][j] << " ";
        }
        cout <<endl;
    }

    double b = 0;
    double s = 0;
    for (int i = 0; i < C; i += 2) {
        for (int j = 0; j < M; j++) {
            s += a[i][j];
        }
        b = s;
    }

    return(b/M);
}
int main()
{
    setlocale(LC_ALL, "ru");
    size_t C;//СТРОКИ
    cout << "Введите количество СТРОК:" << endl;
    cin >> C;
    cout << V(C);
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
